thibautldz/BLE_Scanner/STM32_WPAN/App/p2p_client_app.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    p2p_server_app.c
 * @author  MCD Application Team
 * @brief   peer to peer Server Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"

#include "dbg_trace.h"

#include "ble.h"
#include "p2p_client_app.h"

#include "stm32_seq.h"
#include "app_ble.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

typedef enum
{
  P2P_START_TIMER_EVT,
  P2P_STOP_TIMER_EVT,
  P2P_NOTIFICATION_INFO_RECEIVED_EVT,
} P2P_Client_Opcode_Notification_evt_t;

typedef struct
{
  uint8_t * pPayload;
  uint8_t     Length;
}P2P_Client_Data_t;

typedef struct
{
  P2P_Client_Opcode_Notification_evt_t  P2P_Client_Evt_Opcode;
  P2P_Client_Data_t DataTransfered;
}P2P_Client_App_Notification_evt_t;

typedef struct
{
  /**
   * state of the P2P Client
   * state machine
   */
  APP_BLE_ConnStatus_t state;

  /**
   * connection handle
   */
  uint16_t connHandle;

  /**
   * handle of the P2P service
   */
  uint16_t P2PServiceHandle;

  /**
   * end handle of the P2P service
   */
  uint16_t P2PServiceEndHandle;

  /**
   * handle of the Tx characteristic - Write To Server
   *
   */
  uint16_t P2PWriteToServerCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */
  uint16_t P2PWriteToServerDescHandle;

  /**
   * handle of the Rx characteristic - Notification From Server
   *
   */
  uint16_t P2PNotificationCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Rx characteristic
   */
  uint16_t P2PNotificationDescHandle;

}P2P_ClientContext_t;

enum UUID_PROPERTIES
{
 UUID_READ               =   (0x02),
 UUID_WRITE_WNR          =   (0x04),
 UUID_READ_WRITE_WNR 	 =   (0x06),
 UUID_WRITE              =   (0x08),
 UUID_READ_WRITE		 =   (0x0A),
 UUID_NOTIFY		     =   (0x10),
 UUID_INDICATES	   		 =   (0x20),
};
uint8_t uuid_byte_one = 0;
uint8_t INDEX_DISC = 0;

#define MAX_PROPERTIES   20
#define MAX_SERVICES     10

typedef struct
{
	uint16_t handle_serv[MAX_PROPERTIES];
	uint8_t IdProperties[MAX_PROPERTIES];
} Service_scan_t;

Service_scan_t scan_services[MAX_SERVICES];
static uint8_t index_services;
static uint8_t index_properties;

/* USER CODE BEGIN PTD */
typedef struct{
  uint8_t                                     Device_Led_Selection;
  uint8_t                                     Led1;
}P2P_LedCharValue_t;

typedef struct{
  uint8_t                                     Device_Button_Selection;
  uint8_t                                     Button1;
}P2P_ButtonCharValue_t;

typedef struct
{

  uint8_t       Notification_Status; /* used to chek if P2P Server is enabled to Notify */

  P2P_LedCharValue_t         LedControl;
  P2P_ButtonCharValue_t      ButtonStatus;

  uint16_t ConnectionHandle; 


} P2P_Client_App_Context_t;

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_ClientContext_t aP2PClientContext[BLE_CFG_CLT_MAX_NBR_CB];

/**
 * END of Section BLE_APP_CONTEXT
 */
/* USER CODE BEGIN PV */
PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_Client_App_Context_t P2P_Client_App_Context;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void Gatt_Notification(P2P_Client_App_Notification_evt_t *pNotification);
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
/* USER CODE BEGIN PFP */
static tBleStatus Write_Char(uint8_t Service_Instance, uint8_t *pPayload);
static void Button_Trigger_Received( void );
static void Update_Service( void );
static void display_UUID( uint8_t * package, uint8_t idx );
static void rx_usartCallBack_Service( void );
static void rx_usartCallBack_ReadorWrite( void );

aci_att_read_by_group_type_resp_event_rp0 * advertising_event;
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
uint8_t buff_services[2];
uint8_t buff_RorW[1];
uint8_t numproperty_for_RoW_cb;
uint8_t numservice_for_RoW_cb;
static void rx_usartCallBack_ReadorWrite( void )
{
	uint8_t choice = buff_RorW[1];
	if( choice == 1 || choice == 2 )
	{
		if(choice == 1)
		{
			// The handle to Read/write is P2PWriteToServer
			aP2PClientContext[numproperty_for_RoW_cb].state = APP_BLE_DISCOVER_READ_DESC;
			aP2PClientContext[numproperty_for_RoW_cb].P2PWriteToServerCharHdle = scan_services[numservice_for_RoW_cb].handle_serv[numproperty_for_RoW_cb];
		}
		else
		{
			aP2PClientContext[numproperty_for_RoW_cb].state = APP_BLE_DISCOVER_WRITE_DESC;
			aP2PClientContext[numproperty_for_RoW_cb].P2PWriteToServerCharHdle = scan_services[numservice_for_RoW_cb].handle_serv[numproperty_for_RoW_cb];
		}
	}
	else
	{
		APP_DBG_MSG("You have to type 1 or 2, try again \n\r");
		HW_UART_Receive_IT(hw_uart1, buff_RorW , sizeof(buff_RorW), rx_usartCallBack_ReadorWrite);
	}
}
static void rx_usartCallBack_Service( void )
{
	uint8_t num_service = buff_services[0]-48;
	uint8_t num_property = buff_services[1]-48;
	numproperty_for_RoW_cb = num_property;
	numservice_for_RoW_cb = num_service;
	if( (num_service < 0 || num_service > 9) && (num_property < 0 || num_property > 9) )
	{
		APP_DBG_MSG("You have to write a correct number, try again \n\r");
		HW_UART_Receive_IT(hw_uart1, buff_services , sizeof(buff_services), rx_usartCallBack_Service);
	}
	else
	{
	uint8_t property = scan_services[num_service].IdProperties[num_property];

	switch(property)
	{
	case(UUID_READ) :
		aP2PClientContext[num_property].state = APP_BLE_DISCOVER_READ_DESC;
		aP2PClientContext[num_property].P2PWriteToServerCharHdle = scan_services[num_service].handle_serv[num_property];
	break;

