thibautldz/BLE_Scanner/STM32_WPAN/App/p2p_client_app.c
#if(CFG_DEBUG_APP_TRACE != 0)
#endif
#if (UUID_128BIT_FORMAT==1)
                aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
                aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
#else
                aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
                aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
#endif
                index_services++;
                aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
                idx += 6;
                index++;
              }
            }
          }
        break;

        case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
        {

          aci_att_read_by_type_resp_event_rp0 *pr = (void*)blue_evt->data;
          uint8_t idx;
          uint16_t uuid, handle;

          /* the event data will be
           * 2 bytes start handle
           * 1 byte char properties
           * 2 bytes handle
           * 2 or 16 bytes data
           */

          uint8_t index;

          index = 0;
          while((aP2PClientContext[index_properties].connHandle != pr->Connection_Handle))
            index++;

            /* we are interested in only 16 bit UUIDs */
#if (UUID_128BIT_FORMAT==1)
            idx = 17;
            if (pr->Handle_Value_Pair_Length == 21)
#else
              idx = 5;
            if (pr->Handle_Value_Pair_Length == 7)
#endif
            {
              pr->Data_Length -= 1;
              while(pr->Data_Length > 0)
              {
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx+1]);

                /* store the characteristic handle not the attribute handle */
#if (UUID_128BIT_FORMAT==1)
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);
#else
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-2]);
#endif

                  uint8_t Property = pr->Handle_Value_Pair_Data[idx-15];
                  if(uuid_byte_one == uuid)
                  {
                  APP_DBG_MSG("  %d   ",Property);
                  switch(Property)
                  {
                  case(UUID_READ) :
						display_UUID(pr->Handle_Value_Pair_Data, idx);
				        APP_DBG_MSG("   READ\n\r");
				        scan_services[index_services].IdProperties[index_properties] = Property;
				        index_properties++;
				  break;

                  case(UUID_WRITE_WNR) :
						display_UUID(pr->Handle_Value_Pair_Data, idx);
						APP_DBG_MSG("   WRITE WITHOUT RESPONSE\n\r");
						scan_services[index_services].IdProperties[index_properties] = Property;
						scan_services[index_services].handle_serv[index_properties] = handle;
						index_properties++;
				  break;

                  case(UUID_READ_WRITE_WNR) :
						display_UUID(pr->Handle_Value_Pair_Data, idx);
		                APP_DBG_MSG("   READ/WRITE WHITHOUT RESPONSE\n\r");
		                scan_services[index_services].IdProperties[index_properties] = Property;
		                index_properties++;
                  break;

                  case(UUID_READ_WRITE) :
					    display_UUID(pr->Handle_Value_Pair_Data, idx);
						APP_DBG_MSG("  READ/WRITE\n\r");
						scan_services[index_services].IdProperties[index_properties] = Property;
						index_properties++;
				  break;

                  case(UUID_WRITE) :
		               display_UUID(pr->Handle_Value_Pair_Data, idx);
					   APP_DBG_MSG("   WRITE\n\r");
					   scan_services[index_services].IdProperties[index_properties] = Property;
					   index_properties++;
				  break;

                  case(UUID_NOTIFY) :
						display_UUID(pr->Handle_Value_Pair_Data, idx);
				        APP_DBG_MSG("   NOTIFY\n\r");
				        scan_services[index_services].IdProperties[index_properties] = Property;
				        index_properties++;
				  break;

                  case(UUID_INDICATES) :
						display_UUID(pr->Handle_Value_Pair_Data, idx);
					 	APP_DBG_MSG("   INDICATES\n\r");
					 	scan_services[index_services].IdProperties[index_properties] = Property;
					 	index_properties++;
				  break;

                  default :
                  break;
                  }
                  /// activation de la selection de
                  //APP_DBG_MSG("   To which service and sub-service you want to connect ? first service/second sub-service \n\r");
                  aP2PClientContext[index_properties].state = APP_BLE_WAIT_UART;
                  }
                //  aP2PClientContext[index].state = APP_BLE_DISCOVER_WRITE_DESC;
             //   aP2PClientContext[index].P2PWriteToServerCharHdle = handle;
//                }
//
//                else if(uuid == P2P__CHAR_UUID)
//                {
//                  APP_DBG_MSG("-- GATT : NOTIFICATION_CHAR_UUID FOUND  - connection handle 0x%x\n\r", aP2PClientContext[index].connHandle);
//                  APP_DBG_MSG("UUID 2 : %x",uuid);
//                  aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
//                  aP2PClientContext[index].P2PNotificationCharHdle = handle;
//                }
#if (UUID_128BIT_FORMAT==1)
                pr->Data_Length -= 21;
                idx += 21;
#else
                pr->Data_Length -= 7;
                idx += 7;
#endif
              }
            }
          }
        break;

        case EVT_BLUE_ATT_FIND_INFORMATION_RESP:
        {
          aci_att_find_info_resp_event_rp0 *pr = (void*)blue_evt->data;

          uint8_t numDesc, idx, i;
          uint16_t uuid, handle;

          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].connHandle != pr->Connection_Handle))

            index++;

